IDEA Open Model
LineSegment3D Properties
The LineSegment3D type exposes the following members.
Properties
Name | Description
EndPoint
 Gets or sets the reference to Point3D endpoint of the segment.
 (Inherited from Segment3D.)
Id
 Element Id
 (Inherited from OpenElementId.)
LocalCoordinateSystem
 Local coordinate system
 (Inherited from Segment3D.)
StartPoint
 Gets or sets the reference to Point3D startpoint of the segment.
 (Inherited from Segment3D.)
Top
See Also
Reference
LineSegment3D Class
IdeaRS.OpenModel.Geometry3D Namespace